tempmenu/app/views/ratings/_form.html.erb

    <%= f.label :eatery_id %> <br>
    <%= f.collection_select :eatery_id, Eatery.all, :id, :name, prompt: true %>
---
SELECT "eateries".* FROM "eateries"