tempmenu/app/views/eateries/_eatery.html.erb

        <% eatery.food_items.sample(3).each_with_index do |f, i| %>
            <%= "#{f}#{', ' if i < 2 and i < eatery.food_items.count - 1}" %>
---
SELECT "food_items".* FROM "food_items" WHERE "food_items"."eatery_id" = ?  [["eatery_id", 1]]
SELECT COUNT(*) FROM "food_items" WHERE "food_items"."eatery_id" = ?  [["eatery_id", 1]]