tempmenu/app/views/eateries/show.html.erb

SELECT "food_items".* FROM "food_items" WHERE "food_items"."eatery_id" = ?  [["eatery_id", 2]]
---
	<ul>
		<% @eatery.food_items.each do | food_item | %>