tempmenu/app/controllers/eateries_controller.rb

SELECT "eateries".* FROM "eateries"
---
  def index
    @eateries = Eatery.all

INSERT INTO "eateries" ("name", "description", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dining hall"], ["description", "yum"], ["location", "2"], ["created_at", 2016-12-09 22:01:31 UTC], ["updated_at", 2016-12-09 22:01:31 UTC]]
---
  def create
    @eatery = Eatery.new(eatery_params)

    respond_to do |format|
      if @eatery.save

UPDATE "eateries" SET "name" = ?, "description" = ?, "location" = ?, "updated_at" = ? WHERE "eateries"."id" = ?  [["name", "North Dining Hall"], ["description", "Meh"], ["location", "Notre Dame"], ["updated_at", 2016-12-12 00:42:42 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @eatery.update(eatery_params)

SELECT  "eateries".* FROM "eateries" WHERE "eateries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_eatery
      @eatery = Eatery.find(params[:id])