tempmenu/app/controllers/food_items_controller.rb

  def index
    @food_items = FoodItem.all
---
SELECT "food_items".* FROM "food_items"

  def create
    @food_item = FoodItem.new(food_item_params)

    respond_to do |format|
      if @food_item.save
---
INSERT INTO "food_items" ("name", "price", "created_at", "updated_at", "eatery_id") VALUES (?, ?, ?, ?, ?)  [["name", "pretzels"], ["price", #<BigDecimal:7fb5829fb2c8,'0.3E1',9(18)>], ["created_at", 2016-12-10 19:20:23 UTC], ["updated_at", 2016-12-10 19:20:23 UTC], ["eatery_id", 1]]

    def set_food_item
      @food_item = FoodItem.find(params[:id])
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]