tempmenu/app/controllers/ratings_controller.rb

  def index
    @ratings = Rating.all
---
SELECT "ratings".* FROM "ratings"

  def create
    @rating = Rating.new(rating_params)

    respond_to do |format|
      if @rating.save
---
INSERT INTO "ratings" ("description", "stars", "created_at", "updated_at", "eatery_id") VALUES (?, ?, ?, ?, ?)

    def set_rating
      @rating = Rating.find(params[:id])
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]