app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "erinturley@live.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by_email params[:user][:email]