app/controllers/date_ranges_controller.rb

SELECT "date_ranges".* FROM "date_ranges"
---
  def index
    @date_ranges = DateRange.all