app/controllers/home_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)
---
  def save_user
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save