tempmenu/app/views/food_items/_form.html.erb

  <div class="field">
    <%= f.collection_select :food_item_id, Eatery.all, :id, :name, prompt: "Select an eatery" %>
---
SELECT "eateries".* FROM "eateries"